In [4]:
import pandas as pd
import numpy as np

mydict = {'apple':100, 'banana':50, 'car':100}
data1 = pd.Series(mydict)
print(data1)

ind = ['foo', 'bar', 'baz', 'donkey']
data2 = pd.Series(mydict,index=ind)
print(data2)

data2 = data2.isnull() #NaN值:放入True
print(data2)

apple     100
banana     50
car       100
dtype: int64
foo      NaN
bar      NaN
baz      NaN
donkey   NaN
dtype: float64
foo       True
bar       True
baz       True
donkey    True
dtype: bool

In [5]:
data1+data2

apple     NaN
banana    NaN
bar       NaN
baz       NaN
car       NaN
donkey    NaN
foo       NaN
dtype: object

In [6]:
data2.sort_index()

bar       True
baz       True
donkey    True
foo       True
dtype: bool

In [7]:
data1.sort_values()

banana     50
apple     100
car       100
dtype: int64

In [9]:
data1.sort_index()

apple     100
banana     50
car       100
dtype: int64

In [11]:
df = pd.DataFrame(np.arange(12).reshape((3,4)), index=['three', 'one', 'two'], \
                    columns = ['c','a','b','d'])
df

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [13]:
df.sort_index()

       c  a   b   d
one    4  5   6   7
three  0  1   2   3
two    8  9  10  11

In [14]:
df.sort_index(axis=1, ascending=False)

        d  c   b  a
three   3  0   2  1
one     7  4   6  5
two    11  8  10  9

In [15]:
df.sort_values(by=['d'])

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [17]:
df.sort_values(by=['d','c'])

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [20]:
data3 = pd.Series([7, -5, 7, 4, 2, 0, 4, 7])
res = data3.sort_values()

for i in range(res.shape[0]):
    print(res.iloc[i])

-5
0
2
4
4
7
7
7

0    7.0
1    1.0
2    7.0
3    4.5
4    3.0
5    2.0
6    4.5
7    7.0
dtype: float64

In [24]:
df = pd.DataFrame(np.arange(12).reshape((3,4)), index=['three', 'one', 'two'], \
                    columns = ['c','a','b','d'])

df

       c  a   b   d
three  0  1   2   3
one    4  5   6   7
two    8  9  10  11

In [26]:
df.sum()

c    12
a    15
b    18
d    21
dtype: int64

In [25]:
df.sum(axis=1)

three     6
one      22
two      38
dtype: int64